Revit 2027 API
Application.NewPointRelativeToPoint Method
Create a PointRelativeToPoint object, which is used to define the placement of a ReferencePoint relative to a host point.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointRelativeToPoint NewPointRelativeToPoint(
	Reference hostPointReference
)
Public Function NewPointRelativeToPoint (
	hostPointReference As Reference
) As PointRelativeToPoint
public:
PointRelativeToPoint^ NewPointRelativeToPoint(
	Reference^ hostPointReference
)
member NewPointRelativeToPoint :
        hostPointReference : Reference -> PointRelativeToPoint
Parameters
hostPointReference Reference
The reference of the host point.
Return Value
PointRelativeToPoint
If creation is successful then a new PointRelativeToPoint object is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument hostPointReference is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace